Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རང་བཞིན་གྱི་ལུས་ཤིན་ཏུ་དྲི་མ་དང་བྲལ་བ་ཡོངས་སུ་དག་པས་དྲི་མ་མེད་པའི་བདག་ཉིད་ཀྱི་ལུས་རང་བཞིན་གྱིས་མདུན་དུ་མཆིས་པར་འགྱུར་རོ། །མཆོག་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ།
en: Noble Avalokiteśvara will appear in his body of secret essence, which is by nature completely pure, without stains or blemishes.

source: །རྣམ་པ་ཐམས་ཅད་དུ་གྲུབ་པ་སྩོལ་བར་འགྱུར་རོ། །དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ཆོ་ག་ཞིབ་མོའི་ཕྱག་རྒྱ་གྲུབ་པ་སྩོལ་བར་འགྱུར་རོ།
en: Standing before the vidyā holder, he will grant all desirable things and all accomplishments, including the accomplishment of the ritual seal of the heart mantra of Amoghapāśa.

source: །ཇི་ལྟར་སྙིང་ལས་སྐྱེས་པའི་བུ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཐོབ་ཀྱི་བར་དུ་ཡོངས་སུ་སྐྱོང་བར་བགྱིད་དོ། །དེ་ལྟ་བས་ན། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་གྱི་དཀྱིལ་འཁོར་མཐའ་དག་ཡོངས་སུ་རྫོགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་ལེགས་པར་བརྒྱན་པ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་དང་བཅས་པ་ན།
en: They will protect the vidyā holder as their heart son, until he has attained the awakening of a buddha. “

source: ཁང་པ་བརྩེགས་པ་ལེགས་པར་བརྒྱན་པའི་སེང་གེའི་ཁྲིའི་མཆོག་ལ་འཕགས་པ་རྒྱལ་བ་འོད་དཔག་མེད་འོད་ཟེར་བརྒྱ་སྟོང་ཕྲག་འབུམ་འཕྲོ་བའི་སྐུ་བཞུགས་ཤིང་ཆོས་སྟོན་པ་བལྟ་བར་འཚལ་ན། རིག་སྔགས་འཆང་དེས་ལེགས་པར་བཀྲུས་ཏེ། གཙང་མར་གྱུར་པས་གོས་གཙང་མ་བགོས་ཏེ། ཆོ་འཕྲུལ་གྱི་ཟླ་བ་ཡར་གྱི་ངོ་ལ་བྱམས་པའི་སེམས་དང་། སྙིང་རྗེའི་ལྷག་པའི་བསམ་པས་གུས་པ་དང་། དད་པ་དང་། ཞེས་དང་། བླ་མར་བགྱིའོ།
en: A vidyā holder who wishes to see the world system named Sukhāvatī in its entirety, adorned with perfect buddha fields, and to see Noble Amitābha, the best of victors, with the retinue-hosts of bodhisattvas and sitting on a lion seat in an ornamented palace, his body ablaze with hundreds of thousands of billions of light rays as he teaches the Dharma, should purify himself as required for a vidyā holder, keep his heart and mind completely pure, and cultivate, throughout the prātihāra fortnight, thoughts of loving kindness, faith, respect, a heart of compassion, and regard for his master.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རི་མོའི་གཟུགས་ལ་ཅི་འབྱོར་པ་མེ་ཏོག་དང་། བདུག་པ་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་།
en: He should offer to the great cloth painting of Noble Avalokiteśvara whatever articles are available, such as flowers, incense, perfume, garlands, unguents, scented powders, robes, cloth, and banners.

source: ལྷབ་ལྷུབ་དང་། བ་དན་གྱིས་མཆོད་པར་བགྱིའོ། །ཚེས་བརྒྱད་ནས་ཚེས་བཅུ་གསུམ་གྱི་བར་ལ་ཟས་དཀར་གསུམ་འཚལ་བར་བགྱིའོ། །རི་མོའི་གཟུགས་ཀྱི་མདུན་དུ་ཉིན་གཅིག་བཞིན་དུས་གསུམ་དུ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་དང་།
en: From the eighth day of the bright fortnight through the thirteenth, he should live on the three ‘white’ foods and recite daily, and he should recite the secret heart mantra of Amoghapāśa twenty-one times in front of the painting.

source: ཚིག་གཞན་མི་སྨྲ་བར་ཁྲོ་བོའི་རྒྱལ་བོའི་སྙིང་པོ་དང་།
en: He should refrain from other talk.

source: ཉེ་བའི་སྙིང་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས། རི་མོའི་གཟུགས་དེ་ཉིད་ཀྱི་མདུན་དུ་མཆིས་ནས་ཉལ་བར་བགྱིའོ།
en: He should likewise recite the heart and the auxiliary heart mantras of Krodharāja one hundred and eight times in front of the painting.

source: །མཆོད་ཡོན་དང་ཡོན་ཆབ་དུས་གསུམ་དུ་དབུལ་བར་བགྱིའོ། །ཨ་ག་རུ་དང་།
en: A welcome offering of water, placed in front of the painting, should be offered at the three junctions of the day.

source: ཙན་དན་དང་། དུ་རུ་སྐ་དང་། གུ་གུལ་གྱི་མེ་ཏོག་ཁུ་བ་དང་བཅས་པ་གླ་རྩི་དང་ལྷན་ཅིག་བསྲེས་ནས་བླང་བར་བགྱིའོ། །དགུག་པའི་སྔགས་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ། དོན་ཡོད་ཁམས་གསུམ་རྣམ་པར་གྲགས། །བདུག་པའི་རྒྱལ་པོ་བླ་ན་མེད། །གང་ཕྱིར་བདུགས་པ་ཙམ་གྱིས་ནི།
en: The vidyā holder should, at that time, ‘wake up’ the deity using the incense of agarwood, sandalwood, olibanum, and bdellium, together with essential flower-oils and musk, and recite the summoning mantra one thousand and eight times. “

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་བདུག་པའི་སྤྲིན་ཆེན་པོ་འཁྲིགས་པས་རྒྱས་པར་འགྱུར་རོ། །དྲི་འཁྲིགས་པ་དེ་དག་གིས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་ལ།
en: If one uses the supreme king of incense called unfailing purity in the three worlds, all the world systems in the ten directions of the great trichiliocosm will fill, as soon as the incense is lit, with great clouds of incense, including all the buddha fields where all the buddhas and bodhisattvas dwell and the realms of the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and other human and nonhuman beings.

source: དྲི་ཆེན་པོའི་མཆོད་པ་དང་། བདུག་པ་ཆེན་པོའི་མཆོད་པ་བགྱིས་པར་འགྱུར་ཞིང་། དེ་དག་ཐམས་ཅད་དགའ་བར་འགྱུར་རོ།
en: As soon as the incense reaches them during the performance of the incense worship with this great king of fragrances, all diseases will cease, and all nightmares and bad dreams will be completely pacified.

source: །གང་ཡང་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སེམས་ཅན་གང་དག་གིས་བདུག་པའི་དྲི་ཚོར་ན་དེ་དག་ཐམས་ཅད་ངན་སོང་དུ་སྐྱེ་བར་འགྱུར་བའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་ཡོངས་སུ་གཏུགས་པར་འགྱུར་རོ། །འཐབ་པ་དང་། འཐབ་མོ་དང་། མུ་གེ་དང་། རྩོད་པ་དང་། འགྱེད་པ་དང་། ནང་འཁྲུག་པ་དང་། འཁྲུགས་པ་དང་། རྨི་ལམ་ངན་པ་དང་། ཡམས་ཀྱི་ནད་དང་།
en: Even animals who smell the fragrance of the incense will have the wrongdoings and karmic obscurations that lead to rebirth in the lower realms completely purified.

source: གནོད་པ་དང་། འཚེ་བ་དང་། གདུང་བ་དང་། མི་བདེ་བ་ཐམས་ཅད་དང་། ནད་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ།
en: All disputes, quarrels, famines, wars, riots, public unrest, nightmares—all such misfortunes, calamities, and annoyances, including all diseases and ailments—will be completely pacified.

source: །རླུང་དང་། སེར་བ་དང་། གྲང་བ་དང་། ཚ་བའི་སྤྲིན་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ།
en: So will all hurricanes, hailstorms, heat, and cold waves.

source: །སྡིག་པ་ཐམས་ཅད་འཇིག་པར་འགྱུར་རོ། །བྱད་དང་། གཡེངས་བྱེད་དང་། སྔགས་ཀྱི་སྦྱོར་བ་ཐམས་ཅད་དང་། དུག་དང་།
en: All nonvirtue will be destroyed, including all the mantras that employ kākhordas and kiraṇas, and all poisons both liquid and powdered.

source: དབྱིག་དུག་དང་། དུག་སྦྱར་མ་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ། །གདོན་ཐམས་ཅད་དང་། བརྗེད་བྱེད་ཐམས་ཅད་དང་། རིམས་དང་བཟའ་ཉེས་དང་། བགོ་ཉེས་དང་། གནོད་སྒྲིབ་དང་། ནད་ཐམས་ཅད་འཇིག་པར་འགྱུར་ཞིང་། རྨི་ལམ་ངན་པ་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ། །གནོད་ལྟས་ཐམས་ཅད་བདུག་པའི་དྲིས་འབྲོས་པར་འགྱུར།
en: All grahas, apasmāras, fevers, indigestion, eating disorders, and evil eye will be cleared up or dispelled when they smell the fragrance of the incense.

source: འཇིག་པར་འགྱུར། འགྱེས་པར་འགྱུར་ཏེ། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མཆིས་ཀྱི་བར་དུ་ལན་འགའ་ཡང་ཚུགས་པར་མི་འགྱུར་རོ།
en: They will disappear and will never recur up until the final attainment of the seat of awakening.

source: །བདུག་པའི་རྒྱལ་པོ་འདི་རྟག་ཏུ་སྦྱར་བར་བགྱིའོ།
en: One should always use this king of incense. “

source: །འདི་ལྟར་ཚེས་བཅུ་བཞིའི་ནུབ་མོ་མཆིས་ལ།
en: Then, on the fourteenth lunar day, the vidyā holder should fast for the whole day and night, recite the heart mantra of Amoghapāśa one hundred and eight times, and recite the mantra of Krodharāja the same number of times.

source: དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བརྒྱ་རྩ་བརྒྱད་དང་། ཁྲོ་བོའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ། །ཟས་དཀར་གསུམ་གྱི་གཏོར་མ་ཅི་འབྱོར་པ་དབུལ་བར་བགྱིའོ། །སྙིང་པོ་དང་ཉེ་བའི་སྙིང་པོ་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ལ། དྲི་དང་འབྲུ་མར་གྱི་མར་མེ་དབུལ་བར་བགྱིའོ།
en: He should offer a bali of three ‘white’ foods, as available, and burn a lamp with fragrant oil while reciting the heart and auxiliary heart mantras of Krodharāja.

source: །རི་མོའི་གཟུགས་དེ་ཉིད་ཀྱི་མདུན་དུ་ནམ་ལངས་ཀྱི་བར་མཆིས་ནས་ཉལ་བར་བགྱི་སྟེ། རྨི་ལམ་དུ་དབྱིག་གི་མཛོད་མཐོང་ངམ།
en: He should sleep in front of the painting until, at dawn, he sees golden treasures in his dreams.

source: བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གཞལ་མེད་ཁང་དང་བཅས། རིན་པོ་ཆེའི་ཤིང་དང་བཅས། རིན་པོ་ཆེའི་རི་དང་བཅས། རྫིང་དང་བཅས། གནས་དང་བཅས། ཁང་པ་བརྩེགས་པ་དང་བཅས། གཞལ་མེད་ཁང་དང་བཅས། རྫུ་འཕྲུལ་དང་ཆོ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ་མཐོང་ངམ།
en: He will see the world system of Sukhāvatī with its palaces, jeweled trees, and jeweled mountains, and also Puṣkiriṇī with its residences, temples, palaces, and all its magical and marvelous displays.

source: དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། ཁང་པ་བརྩེགས་པ་ན་བཞུགས་ལ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: He will see the Tathāgata Amitāyus sitting inside his palatial temple, surrounded by the retinue-hosts of bodhisattvas, and also the congregations of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas. “

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་འཁོར་དང་བཅས་པ་མཐོང་ངམ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚེ་དཔག་མེད་དེ་ཡང་། རིག་སྔགས་འཆད་དེ་ལ་དབུགས་འབྱིན་པར་མཛད་ཅིང་ལེགས་སོ་ཞེས་བགྱི་བ་ཡང་སྩོལ་བར་མཛད་དེ།
en: The blessed Tathāgata Amitāyus, a worthy, fully realized buddha, will, for his part, encourage and applaud the vidyā holder by saying, ‘Great!

source: ཀྱེ་སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་རིག་སྔགས་འཆང་གི་སྐྱེས་བུའི་བྱེད་པ་མང་དུ་བྱས་པ་དང་།
en: It is great, O good man!

source: ཁྱོད་ཀྱིས་དགེ་བའི་རྩ་བ་མང་དུ་བསྐྲུན་པ་དང་།
en: You have performed many honorable acts, O vidyā holder, and planted many roots of virtue.

source: ཁྱོད་ཀྱིས་ལྷག་པར་མང་དུ་བྱས་པ་དང་། ཁྱོད་ཀྱིས་བྱ་བ་གང་ཡིན་པ་བྱས་པ་དང་།
en: By performing what is worth performing, you have acquired much authority.

source: ཁྱོད་ཀྱིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་ཕྱག་རྒྱ་ཆེན་པོ་དང་། གསང་སྔགས་རྣམ་པར་ཕྱེ་བའི་སྙིང་པོ་སྒྲུབ་པ་ནི་གྲུབ་ཟིན་ཏེ། ལེགས་སོ་ལེགས་སོ། །ཁྱོད་རིག་སྔགས་འཆང་གི་སངས་རྒྱས་ཉིད་དུ་གྱུར་ཅིག །
en: You have accomplished, O vidyā holder, the essence of Amoghapāśa, the maṇḍala of liberation, the great seal, the essence of the mantra speech, and buddhahood itself.

source: ཁྱོད་འདི་ནས་མ་འོངས་པའི་མངལ་གྱི་སྐྱེ་བ་བླངས་ཏེ། ཚེ་བརྗེས་ནས་ངའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར་རོ། །བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་འགྱུར་རོ།
en: This is your last birth from a womb; when this birth runs its full course, you will be reborn in a buddha field and will pass on from one buddha field to another, until you finally attain the seat of awakening.’

source: །ཞེས་ཕྱག་གཡས་པ་སྤྱི་བོར་འཇོག་པར་འགྱུར། འཇིག་རྟེན་པའི་དངོས་གྲུབ་ཐམས་ཅད་སྩོལ་ཅིང་འཇིག་རྟེན་ལས་འདས་པའི་དངོས་གྲུབ་སྒྲུབ་པ་སྟེ།
en: Amitāyus will then place his right hand on the vidyā holder’s head, granting him all the mundane accomplishments and the accomplishment of the path that leads beyond this world. “

source: འདི་ནི་དམ་པ་སྒྲུབ་པ་ཡིན་ནོ་ཞེས་བདག་གཉིད་སད་ནས་དགའ་བར་མཐོང་སྟེ།
en: This is the supreme practice, whereby the vidyā holder, thrilled with joy, will see for himself that he is fully realized.

source: སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: With all his karmic obscurations dispelled, he will be completely pure.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བྲམ་ཟེའི་གཟུགས་ཀྱིས་མདུན་ན་མཆིས་པར་འགྱུར་ཞིང་འདོད་པ་ཐམས་ཅད་ཀྱི་མཆོག་སྩོལ་བར་འགྱུར་རོ།
en: Noble Avalokiteśvara, in the garb of a brahmin, will remain in front of him and provide all desirable things.

source: །གཟུགས་ཀྱི་རི་མོ་དེ་ཡང་འབར་ཞིང་འོད་ཟེར་འབྱུང་བར་འགྱུར་རོ།
en: The cloth painting will blaze and emit light.

source: །ཡོན་ཏན་བརྒྱ་སྟོང་མང་པོ་གཞན་ཡང་འཐོབ་པར་འགྱུར་རོ། །འཇིག་རྟེན་པའི་ཕུན་སུམ་ཚོགས་པ་ཡང་འཐོབ་པར་འགྱུར་རོ།
en: He will also obtain hundreds of thousands of other benefits and worldly splendor.

source: །སྐྱེ་བོ་དང་རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་ཐམས་ཅད་དབང་དུ་འགྱུར་ཞིང་ཆེར་མཆོད་པར་འགྱུར་རོ།
en: All people, kings, ministers, brahmins, and householders will remain in his thrall, and he will be greatly venerated.

source: །དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ལས་དོན་ཡོད་པའི་གྲུབ་པ་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ། །གྲུབ་པ་ཆེན་པོ་བླ་ན་མེད་པའང་འཐོབ་པར་འགྱུར་རོ།
en: In return, he will receive great amogha accomplishment from monks and brahmins.

source: །ཉིན་གཅིག་བཞིན་དུ་དུས་གསུམ་དུ་ཕྱག་རྒྱ་བཅིང་བར་བགྱིའོ། །དེ་ནས་ཚེས་བཅུ་བཞི་ལ་ཐོག་མར་དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ལ་ཅི་འབྱོར་པའི་ཡོན་དང་བཅས་པའི་མཆོད་སྟོན་སྩལ་བར་བགྱིའོ། །དེ་ནས་བདག་ཉིད་ལོངས་སྤྱད་པར་བགྱིའོ། །གང་གི་ཚེ་ཡང་སངས་རྒྱས་ལ་བལྟ་བ་དང་།
en: To bring this about, he should form the mudrā three times a day, and then, on the fourteenth day, he should make whatever offerings of money and food are available to monks and brahmins, and only then should he himself eat. “

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་བལྟ་བ་དང་། ལྷ་རྣམས་ལ་བལྟ་བར་འཚལ་བ་ན། དེའི་ཚེ་བདུག་པའི་རྒྱལ་པོ་ལ་དགུག་པའི་གསང་སྔགས་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱི་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བདུག་པར་བགྱིའོ།
en: If the vidyā holder seeks to see a buddha, a bodhisattva, or a deity, he should incant the king of incense twenty-one times with the mantra of summoning and offer the incense to the blessed Buddha.

source: །བདུག་པས་བདུགས་པ་ཙམ་གྱི་མོད་པ་ཞལ་སྟོན་པར་འགྱུར་ཞིང་།
en: The summoned being will show itself as the result of merely burning the incense.

source: དགེ་བའམ་མི་དགེ་བ་ཐམས་ཅད་དམ། ཉམས་པའམ་བྲི་བ་དེ་ཐམས་ཅད་བསྲུང་བར་འགྱུར་རོ།
en: It will explain what is auspicious and what is not, and what will bring loss and what will bring gain.

source: །ཇི་ཙམ་ཚེའི་མཐར་ཐུག་གི་བར་དུ་གསུང་བའམ། འགྲོ་བའམ་འོང་བ་གསུང་བར་འགྱུར་རོ།
en: It will explain everything, including the duration of the vidyā holder’s life and its own death and rebirth. “

source: །དེ་ནས་གསང་སྔགས་ཀྱི་ཆོ་ག་དང་། སྒྲུབ་པའི་དོན་དང་ལས་ཀྱི་ཆོ་ག་ཡང་ཇི་ལྟ་བ་བཞིན་དུ་བཤད་པར་བགྱིའོ།
en: I will now teach, as is proper, the mantra procedures for the successful performance of aim-specific rites: [3] “Oṁ, O lotus holder who grants unfailing victory!

source: །ཨོཾ་པདྨ་དྷ་ར་ཨ་མོ་གྷ་ཛ་ཡ་དེ་ཙུ་རུ་ཙུ་རུ་སྭཱ་ཧཱ།
en: Curu curu, svāhā! “

source: དོན་ཡོད་པའི་རྒྱལ་པོའི་ཉེ་བའི་སྙིང་པོའི་གསང་སྔགས་སོ།
en: This is the auxiliary heart mantra to the heart mantra called Amogharāja. [

source: །ཨོཾ་པདྨ་པཱ་ཤ་དྷ་རཱ་ཡ།
en: 4] “Oṁ, O holder of a lotus noose who grants amogha boons!

source: ཨ་མོ་གྷ་བ་རསཉྩོ་ད་ཡ་ཧཱུྃ། དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ལྷ་དང་། ཀླུ་དང་།
en: Arouse the buddhas, hūṁ! “

source: གནོད་སྦྱིན་དང་།
en: This is the impelling mantra.

source: དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: One should incant mustard seeds with it twenty-one times, mix them with water, and throw the water in the ten directions.

source: མི་དང་། མི་མ་ཡིན་པ་ལ་སོགས་པ་བསྐུལ་བའི་གསང་སྔགས་ཏེ། བདུག་པའི་རྒྱལ་པོས་བདུགས་ནས་ཆབ་དང་། ཡུངས་ཀར་བསྲེས་པ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ནས། ཕྱོགས་བཅུར་གཏོར་ན་ཐམས་ཅད་བསྐུལ་བར་བགྱིས་པར་འགྱུར་རོ།
en: All the tathāgatas, bodhisattvas, devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and other human and nonhuman beings everywhere will become aroused when fumigated with the king of incense and sprinkled with this water. [

source: །ཨོཾ་ཏྲཻ་ལོ་ཀྱ་ཨ་བྷྱ་ཧཱ་ན་ཨ་མོ་གྷ་པཱ་ཤ། །པདྨ་བི་ལོ་ཀི་ཏ་ཨཱ་ཡནྟུ།
en: 5] “Oṁ, O lotus-eyed Amoghapāśa!

source: བྷུ་བ་ནེ་སུར།
en: Traverse the three worlds and come to the earth!

source: སུ་རུ་སུ་རུ།
en: Suru suru suru!

source: བི་མ་ལེ་ཧཱུྃ།
en: O pure being, hūṁ! “

source: དགུག་པའི་གསང་སྔགས་ཏེ།
en: This is the summoning mantra.

source: གུ་གུལ་གྱི་བདུག་པ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས་ཆུ་དང་མེ་ཏོག་བསྲེས་པས་ཕྱོགས་བཅུར་གཏོར་བར་བགྱི་སྟེ།
en: One should incant bdellium incense with it one hundred and eight times, mix the incense with water and flowers, and throw the water in the ten directions.

source: ཐམས་ཅད་ནས་དགུག་པ་དམ་པ་གྲུབ་པ་ལགས་སོ།
en: This is supremely effective in summoning from anywhere. [

source: །ཨོཾ་པདྨ་གྷུ་ཛ་མ་ཧཱ་པཱ་ཤ་དྷཱ་ར་ཎི་མནྟྲ་ཡཱ་མི།
en: 6] “Oṁ, O lotus-armed one who holds the great noose!

source: ཨ་མོ་གྷ་པཱ་ཤ་ཡནྟུ་བྷུ་བ་སྭཱ་ཧཱ།
en: I invite you, one of unfailing power, to come to Earth!

source: མུ་རུ་མུ་རུ་ཧཱུྃ།
en: Muru muru, hūṁ! “

source: དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། དཀྱིལ་འཁོར་ཐམས་ཅད་ན་གནས་པའི་ལྷ་ཚོགས་ལ་སོགས་པ་སྤྱན་དྲང་བའི་གསང་སྔགས་ཏེ།
en: This is the invitation mantra—a vidyā of invitation from anywhere—for all the tathāgatas, bodhisattvas, śrāvakas, and pratyekabuddhas, for all the deities who dwell in the maṇḍalas, and for the devas, nāgas, and so forth.

source: རིལ་བ་སྤྱི་བླུགས་དང་། ཆབ་དང་། མེ་ཏོག་དང་། ཚེམས་ཤིང་ལ་བདུག་པའི་རྒྱལ་པོས་བདུགས་ཏེ། ཐམས་ཅད་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ། ཐམས་ཅད་སྤྱན་དྲང་བའི་རིག་སྔགས་སོ།
en: One should fumigate the vase, the water, the flowers, and the tooth sticks with the king of incense incanted with this mantra one hundred and eight times. [

source: །ཨོཾ་པདྨ་ཨ་མོ་གྷ་བཛྲ་ཨ་དྷིཥྛཱ་ན།
en: 7] “Oṁ, Padmāmogha, get on, get on with vajra-securing the ground!

source: ཀུ་རུ་ཀུ་རུ་སྭཱ་ཧཱ།
en: Svāhā! “

source: སའི་དཀྱིལ་འཁོར་བཅིང་བ་སྟེ།
en: This is the mantra of securing the maṇḍala on the ground.

source: ཆབ་དང་ཡུངས་ཀར་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས་ས་ལ་གཏོར་ན།
en: One should incant water and mustard seeds with this mantra one hundred and eight times and cast them to the ground.

source: དཔག་ཚད་སུམ་བརྒྱས་ཀུན་ནས་འཁོར་བའི་སའི་དཀྱིལ་འཁོར་རྡོ་རྗེར་བྱིན་གྱིས་བརླབ་པར་འགྱུར་རོ། །དེ་ཐམས་ཅད་བསྲུངས་པས་ནི་རྡོ་རྗེ་སྲ་བའི་སེམས་སུ་འགྱུར་རོ། །དགྲ་རྣམས་ཀྱིས་མི་མཐོང་བ་དང་། བགེགས་དང་། ལོག་འདྲེན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་།
en: This will consecrate a circular maṇḍala on the ground, one hundred leagues in diameter, so that the ground is composed of vajras, everything there is protected, and the beings there become stable minded.

source: ཤ་ཟ་དང་། བརྗེད་བྱེད་དང་། རོ་ལངས་དང་། མཁའ་འགྲོ་མ་དང་། འདོད་དགུར་བསྒྱུར་བའི་གཟུགས་ཅན་ཐམས་ཅད་ཀྱིས་མི་མཐོང་སྟེ།
en: The vidyā holder will become invisible to all the enemies—to all the vighnas, vināyakas, yakṣas, rākṣasas, bhūtas, piśācas, and apasmāras, and to the ḍākinīs who can assume any shape at will.

source: རྣམ་པ་ཐམས་ཅད་དུ་མི་མཐོང་བས་རྡོ་རྗེ་ལྟར་སྲ་བར་འགྱུར་རོ།
en: He will become invisible and as inviolable as vajra. [

source: །ཨོཾ་ཨ་མོ་གྷ་པཱ་ཤ་པད་མོཏྟ་ར་སིང་ཧཱ།
en: 8] “Oṁ, the throne of Amoghapāśa upon lotuses!

source: སནྟུ་ཊི་སི་རི་སི་རི་ཧཱུྃ།
en: Oṭi, miri miri, hūṁ! “

source: གདན་གྱི་གསང་སྔགས་ཏེ་ཡུངས་ཀར་ལ་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ་ས་ལ་གཏོར་ན།
en: Using this mantra for the seat, one should incant some mustard seeds one thousand and eight times and cast them at the ground.

source: པདྨ་ཆེན་པོའི་གཞལ་ཡས་ཁང་གི་གདན་དུ་བྱིན་གྱིས་བརླབས་ནས་ལེགས་པར་ཕུལ་བར་འགྱུར་རོ།
en: This will magically create a great lotus and consecrate it as a seat.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་སེང་གེའི་གདན་དུ་བྱིན་གྱིས་བརླབས་ནས་ལེགས་པར་ཕུལ་བར་འགྱུར་རོ།
en: The seat, made of the seven precious jewels and blessed by all the tathāgatas, is a supreme offering.

source: རིག་སྔགས་འཆང་གིས་རང་གི་སྟན་ལ་ཆབ་དང་། ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ནས་གཏོར་ཏེ།
en: The vidyā holder should also sprinkle his own seat with water and mustard seeds incanted twenty-one times with this mantra.

source: རིག་སྔགས་འགྲུབ་པའི་པདྨའི་སྟན་གསང་བའི་གསང་སྔགས་སོ།
en: This will purify the seat, making it into a lotus seat of an accomplished vidyā holder. [

source: །ཨོཾ་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ་པདྨ་ཨ་མོ་གྷ་པཱ་ཤ་དྲྀ་ཌྷ་བཛྲ་ཨ་དྷི་ཥྛི་ཏེ་བྷུ་རུ་བྷུ་རུ་བྷན་དྷ་རེ་སྭཱ་ཧཱ།
en: 9] “Oṁ, great compassionate Amoghapāśa! You are founded upon a firm vajra!

source: དཀྱིལ་འཁོར་མཐའ་དག་ན་ཁྱིམ་དང་།
en: Bhuru bhuru, in this best of places, svāhā! “

source: ནགས་ཚལ་དང་། ཀུན་དགའ་ར་བ་དང་། གཙུག་ལག་ཁང་དང་། བསྟི་གནས་དང་། འཆགས་དང་།
en: With this mantra the vidyā holder can completely purify the entire maṇḍala, including houses, forests, pleasure groves, monasteries, shelters, walking areas, and secret retreat places in the forest.

source: ཕུག་དང་། དགོན་པ་དང་། གནས་བསང་བའི་ཕྱིར་དྲི་ཆབ་དང་། ཡུངས་ཀར་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས་གཏོར་བར་བགྱིས་ཏེ། གནས་སུ་གཏོགས་པ་ཐམས་ཅད་བསང་བ་ཆེན་པོ་བགྱིས་པར་འགྱུར་རོ། །ཉེས་པར་བགྱིད་པ་དང་།
en: He can completely purify all places by sprinkling them with perfumed water and mustard seeds incanted one hundred and eight times.

source: བགེགས་དང་། ལོག་འདྲེན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་ཐམས་ཅད་འབྲོས་པར་འགྱུར་ཏེ།
en: All the wicked vighnas, vināyakas, yakṣas, rākṣasas, and bhūtas will be warded off.

source: གནས་བསང་བའི་གསང་སྔགས་སོ།
en: This mantra is for purifying the place. [

source: །ཨོཾ་པདྨ་ཨ་མོ་གྷ་པཱ་ཤེ་ན་ས་མནྟཱ་ད་ཤ་སུ་དིཀྵུ་སི་མཱ་བ་ན་དྷ་ཡ།
en: 10] “Oṁ, secure the border surrounding the ten directions with the unfailing lotus rope!

source: ཏུ་རུ་ཏུ་རུ་ཧཱུྃ།
en: Turu turu, hūṁ! “

source: ལྕགས་ཀྱི་ཕུར་བུ་སོར་བརྒྱད་པའི་ཚད་ལྔ་ལ། ཚོན་སྣ་ལྔའི་སྐུད་པས་དཀྲིས་ཏེ། ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས་ཕྱོགས་བཞིར་གཟུགས་པར་བགྱིའོ། །ལྔ་པ་ནི་དབུས་ཀྱི་གཞིར་གཟུགས་པར་བགྱི་སྟེ།
en: The vidyā holder should wind a five-colored thread onto five iron stakes that are eight fingers long, incant them with this mantra one thousand and eight times, and drive them into the ground in the four corners, with the center being the fifth.

source: རྒྱང་གྲགས་བདུན་འཁོར་བར་མཚམས་བཅིང་བ་བགྱིས་པར་འགྱུར་རོ།
en: This will create an enclosing outer boundary at the distance of seven leagues.

source: །ཇི་སྲིད་དུ་ཕུར་བུ་མ་ཕྱུང་བ་དེ་སྲིད་དུ་མཚམས་ཆེན་པོ་བཅིང་བ་བགྱིས་པར་འགྱུར་རོ།
en: This great boundary will remain until the stakes are pulled out. [

source: །ཨོཾ་ཨ་མོ་གྷ་མཎྜ་ལ་བནྡྷཱ་ཡ་ས་མནྟེ་ན།
en: 11] “Oṁ, amogha maṇḍala!

source: པདྨ་མ་ཧཱ་བདྨེ་དྷུ་རུ་དྷུ་རུ་སྭཱ་ཧཱ།
en: Secure the borders all around with lotuses and great lotuses! Dhuru dhuru, svāhā! “

source: དཀྱིལ་འཁོར་བཅིང་བ་སྟེ།
en: This is the mantra for securing the maṇḍala.

source: དྲི་ཆབ་དང་། ཡུངས་ཀར་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས་དཀྱིལ་འཁོར་མཐའ་དག་དང་། དེ་བཞིན་དུ་འོག་དང་སྟེང་དུ་ཡང་གཏོར་ཏེ།
en: One should incant water and mustard seeds with it one hundred and eight times and sprinkle the entire maṇḍala, including above and below.

source: དཀྱིལ་འཁོར་ཆེན་པོ་བཅིང་བར་བགྱིས་པར་འགྱུར་ཏེ། བགེགས་དང་།
en: This will secure a great outer maṇḍala.

source: ལོག་འདྲེན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་མཆི་བར་འོས་པ་ཐམས་ཅད་ཀྱིས་མཆི་བར་མི་འགྱུར་རོ།
en: No vighnas, vināyakas, yakṣas, rākṣasas, bhūtas, or piśācas will be able to cross it.

source: །སེམས་ཅན་གདུག་པ་དང་། ལྷ་འམ། ཀླུ་གདུག་པ་གང་སུ་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ཟིལ་གྱིས་མནན་པར་འགྱུར་རོ།
en: All the wicked beings there are, such as wicked gods or nāgas, will be prevented from coming.

source: །འཇིག་རྟེན་པའི་བགྱི་བ་ངན་པ་དང་། སྔགས་ངན་པ་དང་། སེམས་ངན་པ་དང་། བགྱིད་པ་ངན་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པར་འགྱུར་རོ། །ཨོཾ་ཨ་མོ་གྷ་པ་རི་ཤུད་དྷེ་ཤོ་དྷ་ཡ་ས་མནྟེ་ན།
en: All worldly or unwholesome activities, defective mantras, and the vile acts of wicked beings will be completely eradicated. [

source: དྷི་རི་དྷི་རི་ཤུད་དྷ་ས་ཏྭ་མ་ཧཱ་པདྨེ་ཧཱུྃ། འདིས་པའི་རྣམ་ལྔ་ལ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ།
en: 12] “Oṁ, amogha purity!

source: དཀྱིལ་འཁོར་གྱི་སའི་ཆ་མཐའ་དག་ན། གཙུག་ལག་ཁང་ངམ། དགོན་པའམ།
en: Purify the entire area!

source: བྱ་སྐྱིབས་སམ།
en: Dhiri dhiri!

source: ཚང་ཆིང་ངམ།
en: O pure being!

source: འཆག་སའམ།
en: O great lotus!

source: གནས་སམ། ཚལ་ལམ། ནགས་ཚལ་ལམ།
en: Hūṁ! “

source: སྐྱེད་མོས་ཚལ་ལམ། ཀུན་དགའ་ར་བའམ། བྲང་སའམ། སྐྱབས་སམ། ཁང་པ་ལ་གཏོར་ན་སྟོང་པའམ། མི་སྟོང་པའམ། འདམ་རྫབ་དང་།
en: The vidyā holder should use this mantra to incant, one thousand and eight times, water prepared with the five products of the cow, and then sprinkle the entire area, whether it is a monastery, a forest hermitage, a secret cave, a hidden place in a thicket, a walking area, a grove, a tended garden, a pleasure grove, a residence, a shelter, or a house.

source: མི་གཙང་བ་དང་། ཕྱག་དར་གྱིས་གང་བ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་དང་། ཡི་དགས་ལ་སོགས་ཏེ་རིགས་ངན་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པར་འགྱུར་རོ།
en: All swamps and cesspools, whether filled on not, will be cleared of any bhūtas, piśācas, pretas, and so forth who feed on refuse, as well as any savages.

source: །གཙང་བ་དག་པར་འགྱུར་རོ། །གནས་གཙང་མར་འགྱུར་རོ།
en: They will be expelled, and the area will become pure. “

source: །བདག་ཉིད་ལ་དབང་བསྐུར་ན་བཟའ་ཉེས་དང་། བགོ་ཉེས་དང་།
en: If the vidyā holder sprinkles himself with the same water, he will be free from problems such as indigestion, eating disorders, or the evil eye.
